#+TITLE: 如何从apt upgrade中排除指定包
#+AUTHOR: lujun9972
#+TAGS: linux和它的小伙伴
#+DATE: [2020-05-13 三 18:02]
#+LANGUAGE:  zh-CN
#+STARTUP:  inlineimages
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

在 archlinux 下可以直接通过 =pacman -Syu --ingore= 来跳过指定包进行升级, 然而ubuntu 下的 apt 居然不提供类似的排除选项，这很让我感到吃惊.
不过网上apt的内容倒是蛮多，经过简单的搜索，很容易找到解决方法。

1. 先用 =apt-mark hold= 来保留要排除的软件包
   #+begin_src shell :dir /sudo::
     sudo apt-mark hold emacs-snapshot
   #+end_src

   #+RESULTS:
   : emacs-snapshot set on hold.

2. 执行升级操作
   #+begin_src shell :dir /sudo::
     sudo apt upgrade -y
   #+end_src

3. 用 =apt-mark unhold= 来取消包的保留
   #+begin_src shell :dir /sudo::
     sudo apt-mark unhold emacs-snapshot
   #+end_src

   #+RESULTS:
   : Canceled hold on emacs-snapshot.

   
如果没有 =apt-mark= 命令，则还可以使用 =dpkg --set-selections= 来保留软件包，关于它的manual如下：
#+begin_example
  --set-selections
              Set package selections using file read from stdin. This file should be in the format  “package  state”,
              where  state  is one of install, hold, deinstall or purge. Blank lines and comment lines beginning with
              ‘#’ are also permitted.

              The available file needs to be up-to-date for this command to be  useful,  otherwise  unknown  packages
              will be ignored with a warning. See the --update-avail and --merge-avail commands for more information.
#+end_example

所以步骤可以修改为
1. 保留要排除的软件包
   #+begin_src shell :dir /sudo::
     echo "emacs-snapshot hold" |sudo dpkg --set-selections
   #+end_src

   #+RESULTS:

2. 执行升级操作
   #+begin_src shell :dir /sudo::
     sudo apt upgrade -y
   #+end_src

3. 取消包的保留
   #+begin_src shell :dir /sudo::
     echo "emacs-snapshot install" |sudo dpkg --set-selections
   #+end_src

   #+RESULTS:
